## chap 3

# mean, median, mode ------------------------------------------------------

# 예제1) 어떤 과목에서 6명의 학생의 점수가 다음과 같다. 표본평균을 구하라.----
# 89 74 91 88 72 84
x <- c(89, 74, 91, 88, 72, 84)
# mean (평균)
mean(x)
n <- length(x)
sum(x)/n

xbar <- mean(x)


# 예제2) 예제1에서 주어진 자료에서 중앙값을 구하라. ----
# 1. sort, length
sort(x) # 정렬 
x_sorted <- sort(x)

# 2. median : 중간값 
Me <- (x_sorted[n/2] + x_sorted[n/2 + 1]) / 2
print(Me)

median(x_sorted)

# 예제3) 2장 예제5의 콩의 개수에 관한 자료에서 최빈값을 구하라.----
# 4	3	4	3	3	5	5	6	4	4	4	3
# 3	4	3	3	6	4	5	3	6	3	2	1
# 4	4	4	4	4	5	3	4	3	1	2	2
# 5	2	4	3	5	5	3	3	3	3	5	5
# 3	3	6	4	3	5	6	4	4	3	3	4

# table, sort
x <- c(4,	3,	4,	3,	3,	5,	5,	6,	4,	4,	4,	3,
       3,	4,	3,	3,	6,	4,	5,	3,	6,	3,	2,	1,
       4,	4,	4,	4,	4,	5,	3,	4,	3,	1,	2,	2,
       5,	2,	4,	3,	5,	5,	3,	3,	3,	3,	5,	5,
       3,	3,	6,	4,	3,	5,	6,	4,	4,	3,	3,	4)

freq <- table(x) # data 오름차순으로 수량 체크 
freq_sorted <- sort(freq) # 빈도 순으로 sort -> 가장 뒤가 최빈값 
freq_sorted_rev <- sort(freq, decreasing = T) # 역 sort -> 가장 앞이 최빈값 

print(freq) 
print(freq_sorted)
print(freq_sorted_rev)

print(names(freq_sorted[length(freq_sorted)]))
print(names(freq_sorted_rev[1]))

# 표본분산, 표본표준편차, 범위 --------------------------------------------------------

# 예제5) 예제1의 자료에서 표본분산과 표본표준편차를 구하라.----
# 89 74 91 88 72 84
x <- c(89, 74, 91, 88, 72, 84)

# mean, -, ^2, sum, length, sqrt ----------------
xbar <- mean(x) # m = 83
xbar

# x의 모든 원소에 대해서 - xbar를 실행!
(x - xbar) # 각 원소에 대한 편차
(x - xbar)^2 # 편차의 제곱 

var = sum((x - xbar)^2 ) / (n-1) # 분산
var

s <- sqrt(var) # 표준편차 
s

(sum(x^2) - n*xbar^2) / (n-1)

# var, sd, sqrt --------------------

var(x)
sd(x)


# 예제6) 예제1의 자료에서 범위를 구하라.----
# 89 74 91 88 72 84
x <- c(89, 74, 91, 88, 72, 84)

# min/max -----------------------------------------------------------------

min(x)
max(x)

# range -------------------------------------------------------------------

range(x)
range(x)[2] - range(x)[1]

# 백분위수 --------------------------------------------------------------------

# quantile --------------------
# x <- c(1,2,3)
# 제 20 백분위수 ?
x <- c(1,2,3)
quantile(x, 0.2)
quantile(x, 0.2, type=2)

# 예제7) 서울의 한 전철역에서 인천의 한 전철역까지 소요되는 시간을 기록한
#        자료가 다음과 같다. (단위: 분)
# 42 40 38 37 43 39 78 38 45 44 40 38 41 35 31 44
# 제50백분위수인 중앙값과 제 20백분위수를 구하라.
# quantile
x <- c(42, 40, 38, 37, 43, 39 ,78 ,38 ,45 ,44 ,40 ,38, 41 ,35, 31, 44)
a <- quantile(x, 0.5, type = 2)
b <- quantile(x, 0.2, type = 2)
a
b


# 예제8) 예제1의 자료에서 사분위수 범위를 구하라.----
# 89 74 91 88 72 84
# quantile, IQR
x <- c(89, 74, 91, 88, 72, 84)

Iqr <- quantile(x, 0.75, type=2) - quantile(x, 0.25, type=2) # 범위
Iqr

IQR(x) # 범위 
IQR(x, type = 2)



# 상자그림 --------------------------------------------------------------------

# 예제11) 어떤 교차로에서 교통소음 정도를 측정한 값이 아래와 같다. ----
#         측정자료를 이용하여 상자그림을 그려라.
# 55.9	63.8	57.2	59.8	65.7	62.7	60.8	51.3	61.8	56
# 66.9	56.8	66.2	64.6	59.5	63.1	60.6	62	  59.4	67.2
# 63.6	60.5	66.8	61.8	64.8	55.8	55.7	77.1	62.1	61
# 58.9	60	  66.9	61.7	60.3	51.5	67	  60.2	56.2	59.4
# 67.9	64.9	55.7	61.4	62.6	56.4	56.4	69.4	57.6	63.8

# boxplot, boxplot(x, horizontal = T)
x <- c(55.9	,63.8	,57.2	,59.8,	65.7,	62.7,	60.8,	51.3,	61.8,	56,
        66.9,	56.8	,66.2,	64.6,	59.5,	63.1,	60.6,	62,	  59.4,	67.2,
       63.6	,60.5	,66.8	,61.8,	64.8,	55.8,	55.7	,77.1,	62.1,	61,
       58.9	,60	  ,66.9	,61.7,	60.3	,51.5,	67	 , 60.2,	56.2	,59.4,
       67.9,	64.9,	55.7,	61.4,	62.6,	56.4,	56.4,	69.4	,57.6,	63.8)


boxplot(x)
boxplot(x, horizontal = T)

# 예제12)2장 예제7에서의 통계학과 신입생의 키에 관한 자료에서 ----
#        남녀를 구분하면 다음과 같이 주어진다. 남자 신입생과 여자신입생에
#        대하여 각각 상자그림을 그리고, 분포를 비교하라.


# 남자	
# 181	170	179	183	178	171	177	174	163	167	163	173	178	170
# 167	177	176	180	169	178	173	173	171	171	170	174	180	
x <- c(181,	170,	179,	183,	178,	171,	177	,174,	163,	167,	163	,173,	178,	170,
         167,	177	,176,	180	,169,	178,173	,173,	171,	171	,170,	174	,180	)
# 여자	
# 161	160	158	169	162	163	158	160	160	158	160	165	170	152
# 158	160	160	159	162	160	167	168	166	164				
y <- c (161	,160	,158,	169	,162,	163,	158	,160,	160,	158	,160,	165,	170,	152,
        158,	160,	160	,159,	162	,160,	167,	168	,166,	164	)
# boxplot(x, y, names = c("M","F"))

boxplot(x, y, names = c("M","F"))

boxplot(x, y, names = c("M","F"), horizontal = T)

